{
  "Comment.nvim": { "branch": "master" },
<<<<<<< Updated upstream
  "LuaSnip": { "branch": "master" },
||||||| Stash base
  "LuaSnip": { "branch": "master" },
=======
  "LuaSnip": { "branch": "master" },
  "avante.nvim": { "branch": "main" },
>>>>>>> Stashed changes
  "beacon.nvim": { "branch": "main" },
<<<<<<< Updated upstream
  "blink-cmp-avante": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
||||||| Stash base
  "blink-cmp-avante": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
  "bufferline.nvim": { "branch": "main" },
=======
  "blink-cmp-avante": { "branch": "master" },
  "blink.cmp": { "branch": "main" },
>>>>>>> Stashed changes
  "ccc.nvim": { "branch": "main" },
  "codecompanion.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "crates.nvim": { "branch": "main" },
  "csvview.nvim": { "branch": "main" },
  "cursor-agent.nvim": { "branch": "main" },
  "debugprint.nvim": { "branch": "main" },
  "diffview.nvim": { "branch": "main" },
  "dressing.nvim": { "branch": "master" },
  "dropbar.nvim": { "branch": "master" },
  "fidget.nvim": { "branch": "main" },
  "file-line": { "branch": "main" },
  "flatten.nvim": { "branch": "main" },
  "fold-cycle.nvim": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "fugitive-difftool.nvim": { "branch": "main" },
<<<<<<< Updated upstream
  "fzf-lua": { "branch": "main" },
  "garbage-day.nvim": { "branch": "main" },
||||||| Stash base
  "fzf-lua": { "branch": "main" },
  "garbage-day.nvim": { "branch": "main" },
=======
  "fzf-lua": { "branch": "main" },
  "garbage-day.nvim": { "branch": "main" },
>>>>>>> Stashed changes
  "gh.nvim": { "branch": "main" },
  "gitgraph.nvim": { "branch": "main" },
  "github-notifications.nvim": { "branch": "master" },
  "github-theme": { "branch": "main" },
  "gitlinker.nvim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "glance.nvim": { "branch": "master" },
  "grug-far.nvim": { "branch": "main" },
  "hardtime.nvim": { "branch": "main" },
  "harpoon": { "branch": "harpoon2" },
  "image.nvim": { "branch": "master" },
  "img-clip.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "key-analyzer.nvim": { "branch": "main" },
  "kitty-repl.nvim": { "branch": "main" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "litee.nvim": { "branch": "main" },
  "lspkind.nvim": { "branch": "master" },
  "markdown-table-mode.nvim": { "branch": "main" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-nvim-dap.nvim": { "branch": "main" },
  "mason-tool-installer.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "mcphub.nvim": { "branch": "main" },
  "mini.bufremove": { "branch": "main" },
  "mini.hipatterns": { "branch": "main" },
  "neo-tree.nvim": { "branch": "v3.x" },
  "neogen": { "branch": "main" },
  "neotest": { "branch": "master" },
  "neotest-plenary": { "branch": "master" },
  "neotest-python": { "branch": "master" },
  "noice.nvim": { "branch": "main" },
  "nui.nvim": { "branch": "main" },
  "numb.nvim": { "branch": "master" },
  "nvim-autopairs": { "branch": "master" },
<<<<<<< Updated upstream
  "nvim-dap": { "branch": "master" },
||||||| Stash base
  "nvim-dap": { "branch": "master" },
=======
  "nvim-dap": { "branch": "master" },
>>>>>>> Stashed changes
  "nvim-dap-go": { "branch": "main" },
  "nvim-dap-python": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dev-container": { "branch": "main" },
  "nvim-lightbulb": { "branch": "master" },
<<<<<<< Updated upstream
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
||||||| Stash base
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
=======
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
>>>>>>> Stashed changes
  "nvim-lspimport": { "branch": "main" },
  "nvim-nio": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-web-devicons": { "branch": "master" },
  "obsidian.nvim": { "branch": "main" },
<<<<<<< Updated upstream
  "plenary.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
||||||| Stash base
  "plenary.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
=======
  "plenary.nvim": { "branch": "master" },
  "render-markdown.nvim": { "branch": "main" },
>>>>>>> Stashed changes
  "rest.nvim": { "branch": "main" },
<<<<<<< Updated upstream
  "snacks.nvim": { "branch": "main" },
  "sonarlint.nvim": { "branch": "main" },
||||||| Stash base
  "sonarlint.nvim": { "branch": "main" },
=======
  "sailor.vim": { "branch": "main" },
  "sonarlint.nvim": { "branch": "main" },
>>>>>>> Stashed changes
  "symbol-usage.nvim": { "branch": "main" },
  "symbols-outline.nvim": { "branch": "master" },
<<<<<<< Updated upstream
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
||||||| Stash base
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
=======
  "tex-kitty": { "branch": "main" },
  "tiny-inline-diagnostic.nvim": { "branch": "main" },
>>>>>>> Stashed changes
  "todo-comments.nvim": { "branch": "main" },
  "toggleterm.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "undotree": { "branch": "master" },
  "venv-selector.nvim": { "branch": "main" },
  "vim-apathy": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-kitty": { "branch": "main" },
  "vim-ledger": { "branch": "master" },
  "vim-log-highlighting": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-maximizer": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rzip": { "branch": "master" },
  "vim-skeleton": { "branch": "master" },
  "vim-snakemake": { "branch": "master" },
  "vim-vinegar": { "branch": "master" },
  "vimtex": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
<<<<<<< Updated upstream
  "window-picker": { "branch": "main" },
  "zellij.vim": { "branch": "main" },
  "zen-mode.nvim": { "branch": "main" }
||||||| Stash base
  "window-picker": { "branch": "main" },
  "zellij.vim": { "branch": "main" }
=======
  "window-picker": { "branch": "main" }
>>>>>>> Stashed changes
}
