cask_args appdir: '/Applications', force: true

# Add standard taps
# tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"
tap "browsh-org/homebrew-browsh"
tap "koekeishiya/formulae"
tap "iina/homebrew-mpv-iina"

# Custom taps tap "koekeishiya/formulae"
tap "Rigellute/tap"
tap "Schniz/tap"
tap "rlue/utils"
tap "epk/epk"

# Homebrew essentials --------------------------------------------------------
#
# cli tools
brew "bat"                        # alternative to cat
brew "calcurse"                   # TODO: What is this one
brew "git"
brew "git-delta"
brew "browsh"                     # terminal browser
brew "fpp"                        # facebook path picker 
brew "fzf"                        # fuzzy finder
brew "ripgrep"                    # like grep, but faster
brew "ydiff"
brew "gnu-sed"
brew "neovim"
brew "lazygit"                    # awesome git util
brew "jq"                         # json-query
brew "yq"                         # yaml-query
brew "btop"                       # like top, but better
brew "tmux"                       # terminal multiplexer
brew "tree"                       # show a tree
brew "wget"                       # like curl
brew "stow"                       # linking files and folders
brew "exa"                        # like ls but better

# brew "mosh"                       # similar to ssh

# Window manager
# brew "yabai"
# brew "skhd"                     # control

#brew "starship"
#brew "composer"
#brew "coreutils"
#brew "dbus"
#brew "editorconfig"
#brew "fnm"
#brew "fontconfig"
#brew "fontforge"
#brew "gawk"
#brew "gitlab-gem"
#brew "ifstat"
#brew "mkcert"
brew "gd"    # TODO: what is this

# Language compilers and runners ----------------------------------------------
#
brew "node"
brew "yarn"
brew "xmlformat"  # web
brew "prettier"
# npm install fixjson 

brew "gcc"
brew 'clang-format'               # C-like

brew "python"
brew "pyright"                    # python
brew "flake8"
brew "black"

brew "shfmt"  # bash

brew "texlive"                    # latex
# cask "mactex-no-gui"            # mactex without crap

#brew "mycli"
brew "ncurses"
#brew "php"
brew "pandoc"
brew "pkg-config"
#brew "portaudio"
#brew "rbenv"
brew "readline"
#brew "readydocker"
brew "rlue/utils/timer"
brew "spotify-tui"
brew "spotifyd"
#brew "tmuxinator"
#brew "tmuxinator-fzf-start"
# brew "sshfs"                    # mount ssh volumes
brew "mupdf-tools"                # tools for pdf  -- TODO: maybe not needed
brew "ffmpeg"                     # video converter

#brew "ruby"


# Containerization ------------------------------------------------------------
brew "docker"
brew "colima"
brew "lazydocker"



# GUI Applications ------------------------------------------------------------
#
cask "iina"                       # video player
cask "transmission"               # torrent client

cask "kitty"                      # best terminal on Earth
# cask "wezterm"

# cask "inkscape"                    # draw

# cask "brave-browser"               # chromium based browser
cask "orion"                       # browser

cask "obsidian"                    # knowledge
cask "rectangle"                   # window manager
cask "grandperspective"            # tools to show up large files
cask "keycastr"                    # cast keys on screen



# Fonts -----------------------------------------------------------------------
cask "font-hasklug-nerd-font"   # I use this font as the nerd one
cask "font-jetbrains-mono"
cask "font-victor-mono"         # main font
cask "font-iosevka"
cask "font-sf-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
