cask_args appdir: '/Applications'

# Add standard taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/services"

# Custom taps
tap "koekeishiya/formulae"
tap "Rigellute/tap"
tap "Schniz/tap"
tap "rlue/utils"
tap "epk/epk"

# Homebrew essentials
brew "bat" # alternative to cat
brew "calcurse"
brew "composer"
brew "coreutils"
brew "dbus"
brew "editorconfig"
brew "fnm"
brew "fontconfig"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gawk"
brew "git"
brew "gitlab-gem"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit" # awesome git util
brew "mkcert"
brew "mosh"
brew "mycli"
brew "ncurses"
brew "neovim"
brew "node"
brew "php"
brew "pkg-config"
brew "portaudio"
brew "python"
brew "rbenv"
brew "readline"
brew "readydocker"
brew "ripgrep"
brew "rlue/utils/timer"
brew "ruby"
brew "skhd"
brew "spotify-tui"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tmuxinator-fzf-start"
brew "tree"
brew "vifm"
brew "vim" # best editor on Earth
brew "wget" # like curl
brew "yabai"
brew "yarn"
brew "sshfs" # mount ssh volumes
brew "mupdf-tools"


# App essentials
cask "kitty" # best terminal on Earth
cask "mactex-no-gui" # mactex without crap
cask "transmission" # torrent client
cask "inkscape" # draw
cask "brave-browser" # chromium based browser
cask "adobe-acrobat-reader" # allows to digitally sign pdfs 

# Fonts
cask "font-fira-code"
cask "font-hasklug-nerd-font"
cask "font-jetbrains-mono"
cask "font-victor-mono"
cask "font-iosevka"
cask "font-sf-mono-nerd-font"
